BOQ/src/Documents/ПроектнаяДокументацияНаИзделие/ПроектнаяДокументацияНаИзделие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроектнаяДокументацияНаИзделие</name>
  <attributes>
    <name>ИдентификаторМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемыйBIMСтандарт</name>
    <type>
      <types>CatalogRef.BIMСтандарты</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДокументации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокументации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьBIM</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиBIM</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлRVT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлSVF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BOQ/src/InformationRegisters/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Файлы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Папка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BOQ/src/Documents/ПроектнаяДокументацияНаИзделие/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	ОбработкаМоделиВыполняется = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	установитьДоступность ();
	
КонецПроцедуры

&НаКлиенте
Процедура установитьДоступность ()

	Элементы.ЗапуститьОбработку.Доступность = Не ОбработкаМоделиВыполняется;
	Элементы.ЗапуститьОбработку.Пометка = ОбработкаМоделиВыполняется;
	Элементы.ПрерватьОбработку.Доступность = ОбработкаМоделиВыполняется;
	
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура ЗагрузитьФайлRVT ( Команда )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		Сообщения.ПредупреждениеПоказать ( "ОбъектНеЗаписан" );
	Иначе
		Если ( Объект.ФайлRVT = "" ) Тогда
			выборФайлаЗагрузкиRVT ();
		Иначе
			Сообщения.ВопросПоказать ( "УдалитьФайлПроектнойДокументации", , "ВопросУдалитьRVT", ЭтотОбъект );
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалитьRVT ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		удалитьПрикрепленныйФайл ( Объект.Ссылка, Объект.ФайлRVT );
		расширение = РаботаСФайлами.ПолучитьРасширениеФайла ( Объект.ФайлRVT );
		имяФайла = СтрЗаменить ( Объект.ФайлRVT, расширение, "" );
		удалитьЗапись ( Объект.Ссылка, имяФайла, расширение );
		выборФайлаЗагрузкиRVT ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура удалитьПрикрепленныйФайл ( Объект, ИмяФайла )
	
	папка = РегистрыСведений.Файлы.ПолучитьПапкуХранения ( Объект );
	путь = папка + ИмяФайла;
	УдалитьФайлы ( путь );
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура удалитьЗапись ( Объект, ИмяФайла, Расширение )
	
	РегистрыСведений.Файлы.УдалитьЗапись ( Объект, ИмяФайла, Расширение );
	
КонецПроцедуры	

&НаКлиенте
Процедура выборФайлаЗагрузкиRVT ()
	
	п = Новый Структура ();
	п.Вставить ( "Фильтр", Сообщения.ТекстПоИД ( "ФильтрRVT" ) );
	п.Вставить ( "МножественныйВыбор", Ложь );
	п.Вставить ( "Оповещение", Новый ОписаниеОповещения ( "ПослеЗагрузкиФайлаПроектнойДокументации", ЭтотОбъект ) );
	РаботаСФайлами.ВыбратьФайлы ( п );	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайлаПроектнойДокументации ( Данные, Парамы ) Экспорт
	
	Если ( Данные <> Неопределено ) Тогда
		Если ( Данные.Файлы.Количество () > 0 ) Тогда
			файл = Данные.Файлы [ 0 ];
			присоединитьФайл ( Объект.Ссылка, файл );
			Объект.ФайлRVT = файл.Имя;
			Объект.НаименованиеДокументации = СтрЗаменить ( файл.Имя, файл.Расширение, "" );
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура присоединитьФайл ( Объект, Файлы )
	
	РегистрыСведений.Файлы.ПрисоединитьФайл ( Объект, Файлы ); 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлRVT ( Команда )

	Если ( Объект.ФайлRVT = "" ) Тогда
		// код ...
	Иначе
		выборФайлаДляСохраненияRVT ();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура выборФайлаДляСохраненияRVT ()
	
	данные = РаботаСФайлами.ПолучитьИмяФайлаРасширение ( Объект.ФайлRVT );
	адрес = получитьПрикрепленныйФайл ( Объект.Ссылка, данные.Имя, данные.Расширение );
	Если ( адрес = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
	п = Новый Структура ();
	п.Вставить ( "Фильтр", Сообщения.ТекстПоИД ( "ФильтрRVT" ) );
	п.Вставить ( "Адрес", адрес );
	п.Вставить ( "МножественныйВыбор", Ложь );
	п.Вставить ( "ИмяФайла", Объект.ФайлRVT );
	п.Вставить ( "Имя", данные.Имя );
	п.Вставить ( "Расширение", данные.Расширение );
	п.Вставить ( "Оповещение", Новый ОписаниеОповещения ( "ПослеСохраненияRVT", ЭтотОбъект ) );
	РаботаСФайлами.СохранитьФайлы ( п );	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияRVT ( Данные, Парамы ) Экспорт
	
	Если ( Данные <> Неопределено ) Тогда
		// код ...
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьПрикрепленныйФайл ( Объект, Имя, Расширение )
	
	Возврат РегистрыСведений.Файлы.ПоместитьФайлВХранилище ( Объект, Имя, Расширение );

КонецФункции

&НаКлиенте
Процедура СохранитьФайлSVF2 ( Команда )

	Если ( Объект.ФайлSVF = "" ) Тогда
		// код ...
	Иначе
		выборФайлаSVF ();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура выборФайлаSVF ()
	
	данные = РаботаСФайлами.ПолучитьИмяФайлаРасширение ( Объект.ФайлSVF );
	адрес = получитьПрикрепленныйФайл ( Объект.Ссылка, данные.Имя, данные.Расширение );
	Если ( адрес = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
	п = Новый Структура ();
	п.Вставить ( "Фильтр", Сообщения.ТекстПоИД ( "ФильтрSVF" ) );
	п.Вставить ( "Адрес", адрес );
	п.Вставить ( "МножественныйВыбор", Ложь );
	п.Вставить ( "ИмяФайла", Объект.ФайлSVF );
	п.Вставить ( "Имя", данные.Имя );
	п.Вставить ( "Расширение", данные.Расширение );
	п.Вставить ( "Оповещение", Новый ОписаниеОповещения ( "ПослеСохраненияSVF", ЭтотОбъект ) );
	РаботаСФайлами.СохранитьФайлы ( п );	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияSVF ( Данные, Парамы ) Экспорт
	
	Если ( Данные <> Неопределено ) Тогда
		// код ...
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработку ( Команда )

	Сообщения.ВопросПоказать ( "ЗапуститьОбработкуМодели", , "ВопросЗапуститьОбработку", ЭтотОбъект );
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗапуститьОбработку ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		ОбработкаМоделиВыполняется = Истина;
		установитьДоступность ();
		Сообщить ( "ТЕСТ", СтатусСообщения.Обычное );  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьОбработку ( Команда )

	Сообщения.ВопросПоказать ( "ПрерватьОбработкуМодели", , "ВопросПрерватьОбработку", ЭтотОбъект );	

КонецПроцедуры

&НаКлиенте
Процедура ВопросПрерватьОбработку ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		ОбработкаМоделиВыполняется = Ложь;
		установитьДоступность ();
		Сообщить ( "ТЕСТ", СтатусСообщения.Обычное );  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРезультатыОбработки ( Команда )

	Сообщения.ВопросПоказать ( "УдалитьРезультатыОбработкиМодели", , "ВопросУдалитьРезультатыОбработки", ЭтотОбъект );

КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалитьРезультатыОбработки ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		Сообщить ( "ТЕСТ", СтатусСообщения.Обычное );  
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
